; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation8 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation7)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(have_image Planet9 image2)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 image2)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 image2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (calibrate satellite0 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 planet9 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet9)
   goals met: 0 of 6
4. (take_image satellite0 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 1 of 6
5. (turn_to satellite0 planet14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet14)
   goals met: 1 of 6
6. (take_image satellite0 planet14 instrument1 image2)
   added: (have_image planet14 image2)
   goals met: 2 of 6
7. (turn_to satellite0 phenomenon13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 6
8. (take_image satellite0 phenomenon13 instrument1 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 6
9. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 6
10. (take_image satellite0 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 6
11. (turn_to satellite0 star10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star10)
   goals met: 4 of 6
12. (take_image satellite0 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 5 of 6
13. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 6
14. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 6 of 6
